
### Pull Request Information
Please review this pull request. Merging the PR will run Terraform Apply with the plan detailed below.

#### Terraform Checks
Init: `success`
Format: `success`
Validation: `success`
Plan: `success`

#### Checkov
Static: `success`
Plan: `success`

<details>
<summary>Plan File</summary>

```terraform
data.github_repository.use2_acr_github_repos["jw-semantic-searcher"]: Reading...
github_actions_secret.use2_main_openai_org_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_ORG_NAME]
github_actions_secret.use2_main_openai_deployment_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_DEPLOYMENT_NAME]
github_actions_secret.use2_main_openai_org_id["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_ORG_ID]
github_actions_secret.use2_main_indexer_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_SEARCH_INDEX_NAME]
data.github_actions_public_key.use2_main_acr_github_key["jw-semantic-searcher"]: Reading...
github_actions_secret.use2_main_github_token["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:TF_GITHUB_TOKEN]
data.github_actions_public_key.use2_main_swa_github_key: Reading...
github_actions_secret.use2_main_openai_project_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_PROJECT_NAME]
data.github_actions_public_key.use2_main_acr_github_key["jw-semantic-searcher"]: Read complete after 1s [id=3380204578043523366]
github_actions_secret.use2_main_openai_project_id["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_PROJECT_ID]
data.github_actions_public_key.use2_main_batch_github_key["jw-semantic-searcher"]: Reading...
github_actions_secret.use2_main_indexer_config_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_SEARCH_SEMANTIC_CONFIG_NAME]
github_actions_secret.use2_main_openai_key["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:OPENAI_KEY]
data.azuread_service_principal.current: Reading...
data.github_actions_public_key.use2_main_swa_github_key: Read complete after 1s [id=3380204578043523366]
data.azuread_service_principal.current: Read complete after 0s [id=/servicePrincipals/d85a6416-307e-4dc3-882d-2acf8262e821]
data.github_repository.use2_acr_github_repos["jw-semantic-searcher"]: Read complete after 1s [id=jw-semantic-searcher]
data.github_actions_public_key.use2_main_batch_github_key["jw-semantic-searcher"]: Read complete after 1s [id=3380204578043523366]
azurerm_resource_group.use2_main_rg: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg]
azurerm_role_assignment.use2_main_kv_role: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Authorization/roleAssignments/d3261ee3-4e78-3bd6-3a37-5e0888d7ef6d]
azurerm_user_assigned_identity.use2_main_sb_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-sb-identity]
azurerm_user_assigned_identity.use2_main_law_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-law-identity]
azurerm_user_assigned_identity.use2_main_batch_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-batch-identity]
azurerm_monitor_data_collection_endpoint.use2_main_sa_monitor: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Insights/dataCollectionEndpoints/JwSemanticSearcher-eus2-dev-sa-monitor]
azurerm_user_assigned_identity.use2_main_acr_indexer_purge_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-acr-purge-identity]
azurerm_user_assigned_identity.use2_main_acr_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-acr-identity]
azurerm_network_security_group.use2_sa_nsg: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/networkSecurityGroups/JwSemanticSearcher-eus2-dev-sa-nsg]
azurerm_search_service.use2_main_ss: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Search/searchServices/jwsemanticsearcher-eus2-dev-ss]
azurerm_network_security_group.use2_bp_nsg: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/networkSecurityGroups/JwSemanticSearcher-eus2-dev-bp-nsg]
azurerm_user_assigned_identity.use2_main_sa_identity: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/JwSemanticSearcher-eus2-dev-sa-identity]
azurerm_virtual_network.use2_main_vnet: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet]
azurerm_network_watcher.use2_main_nwwatcher: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/networkWatchers/JwSemanticSearcher-eus2-dev-nw-watcher]
azurerm_network_security_group.use2_kv_nsg: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/networkSecurityGroups/JwSemanticSearcher-eus2-dev-kv-nsg]
azurerm_container_registry.use2_main_acr: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ContainerRegistry/registries/JwSemanticSearchereus2devacr]
azurerm_log_analytics_workspace.use2_main_law: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law]
azurerm_subnet.use2_bp_subnet: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-bp-subnet]
azurerm_subnet.use2_sa_subnet: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-sa-subnet]
azurerm_subnet.use2_kv_subnet: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-kv-subnet]
github_actions_secret.use2_main_batch_pool_identity_id["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:BATCH_POOL_IDENTITY_ID]
azurerm_role_assignment.use2_main_batch_sa_role: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Authorization/roleAssignments/8744dddd-6ec9-4bb4-0fe0-7e085e5529d5]
azurerm_subnet_network_security_group_association.use2_bp_subnet_nsg_association: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-bp-subnet]
azurerm_subnet_network_security_group_association.use2_sa_subnet_nsg_association: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-sa-subnet]
azurerm_subnet_network_security_group_association.use2_kv_subnet_nsg_association: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Network/virtualNetworks/JwSemanticSearcher-eus2-dev-vnet/subnets/JwSemanticSearcher-eus2-dev-kv-subnet]
azurerm_key_vault.use2_main_kv: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.KeyVault/vaults/jwseeus2devkv]
azurerm_log_analytics_workspace_table.use2_main_law_container_logs_table: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law/tables/ContainerLogV2]
azurerm_log_analytics_workspace_table.use2_main_law_app_console_logs_table: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law/tables/ContainerAppConsoleLogs]
azurerm_log_analytics_workspace_table.use2_main_law_storage_logs_table: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law/tables/StorageBlobLogs]
azurerm_application_insights.use2_main_swa_ai: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Insights/components/JwSemanticSearcher-eus2-dev-swa-ai]
azurerm_role_assignment.use2_main_batch_acr_role: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ContainerRegistry/registries/JwSemanticSearchereus2devacr/providers/Microsoft.Authorization/roleAssignments/e3427341-b698-f882-eea7-ef8fea6de008]
github_actions_secret.use2_main_acr_rg["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:ACR_RESOURCE_GROUP]
github_actions_secret.use2_main_acr_login_server["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_CONTAINER_REGISTRY_SERVER]
github_actions_secret.use2_main_acr_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_CONTAINER_REGISTRY]
azurerm_container_registry_task.use2_main_acr_indexer_purge_task: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.ContainerRegistry/registries/JwSemanticSearchereus2devacr/tasks/JwSemanticSearcher-eus2-dev-acr-purge-task]
azurerm_storage_account.use2_main_sa: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Storage/storageAccounts/jwseeus2devsa]
github_actions_secret.use2_main_ss_api_key["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_SEARCH_SERVICE_API_KEY]
github_actions_secret.use2_main_ss_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_SEARCH_SERVICE_NAME]
azurerm_key_vault_access_policy.use2_main_kv_access_policy: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.KeyVault/vaults/jwseeus2devkv/objectId/d85a6416-307e-4dc3-882d-2acf8262e821]
azurerm_key_vault_access_policy.use2_main_sa_kv_access_policy: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.KeyVault/vaults/jwseeus2devkv/objectId/80757f86-b9ee-4212-8e7f-2a9fbb855bf4]
azurerm_key_vault_key.use2_main_sa_kv_key: Refreshing state... [id=https://jwseeus2devkv.vault.azure.net/keys/JwSemanticSearcher-eus2-dev-sa-key/f3f12a1a1a1d45e48475c7252314b3f2]
azurerm_storage_account_customer_managed_key.use2_main_sa_cmek: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Storage/storageAccounts/jwseeus2devsa]
azurerm_monitor_data_collection_rule_association.use2_main_sa_monitor_association: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Storage/storageAccounts/jwseeus2devsa/providers/Microsoft.Insights/dataCollectionRuleAssociations/configurationAccessEndpoint]
azurerm_storage_container.use2_main_batch_container: Refreshing state... [id=https://jwseeus2devsa.blob.core.windows.net/batch]
azurerm_log_analytics_linked_storage_account.use2_main_sa_law_lsa: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law/linkedStorageAccounts/Ingestion]
azurerm_batch_account.use2_main_batch: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Batch/batchAccounts/jwsemanteus2devbatch]
azurerm_log_analytics_storage_insights.use2_sa_main_law_si: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.OperationalInsights/workspaces/JwSemanticSearcher-eus2-dev-law/storageInsightConfigs/JwSemanticSearcher-eus2-dev-sa-law-si]
github_actions_secret.use2_main_sa_account_container_url["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:AZURE_STORAGE_CONTAINER_URL]
github_actions_secret.use2_main_batch_account_key["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:BATCH_ACCOUNT_KEY]
github_actions_secret.use2_main_batch_account_endpoint["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:BATCH_ACCOUNT_ENDPOINT]
github_actions_secret.use2_main_batch_account_name["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:BATCH_ACCOUNT_NAME]
azurerm_batch_pool.use2_main_batch_pool: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Batch/batchAccounts/jwsemanteus2devbatch/pools/JwSemanticSearcher-eus2-dev-batch-pool]
azurerm_batch_job.use2_main_batch_job: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Batch/batchAccounts/jwsemanteus2devbatch/pools/JwSemanticSearcher-eus2-dev-batch-pool/jobs/JwSemanticSearcher-eus2-dev-batch-job]
github_actions_secret.use2_main_batch_job_id["jw-semantic-searcher"]: Refreshing state... [id=jw-semantic-searcher:BATCH_JOB_ID]
azurerm_static_web_app.use2_main_swa: Refreshing state... [id=/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Web/staticSites/JwSemanticSearcher-eus2-dev-swa]
github_actions_secret.use2_main_swa_api_key: Refreshing state... [id=jw-semantic-searcher:AZURE_STATIC_WEB_APPS_API_TOKEN]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_search_service.use2_main_ss must be replaced
-/+ resource "azurerm_search_service" "use2_main_ss" {
      - allowed_ips                              = [] -> null
      ~ id                                       = "/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Search/searchServices/jwsemanticsearcher-eus2-dev-ss" -> (known after apply)
        name                                     = "jwsemanticsearcher-eus2-dev-ss"
      ~ primary_key                              = (sensitive value)
      ~ query_keys                               = [
          - {
              - key  = "B3vZzfrHopz1J6fy1QlQWw2a7UQSg2Mt2PVdeO6eVeAzSeCQPcYG"
                name = null
            },
        ] -> (known after apply)
      ~ secondary_key                            = (sensitive value)
      - semantic_search_sku                      = "free" -> null
      ~ sku                                      = "standard" -> "free" # forces replacement
        tags                                     = {
            "CreatedBy"   = "Terraform"
            "CreatedOn"   = "2023-06-23"
            "Environment" = "development"
            "Location"    = "East US 2"
            "Owner"       = "Cobollatin"
            "Project"     = "JW Semantic Searcher"
        }
        # (9 unchanged attributes hidden)

      ~ identity {
          ~ principal_id = "30bd79e5-0d72-48b8-b399-0682967c8c9e" -> (known after apply)
          ~ tenant_id    = "0e0cb060-09ad-49f5-a005-68b9b49aa1f6" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_static_web_app.use2_main_swa will be updated in-place
  ~ resource "azurerm_static_web_app" "use2_main_swa" {
      ~ app_settings                       = {
          - "APPINSIGHTS_INSTRUMENTATIONKEY"        = (sensitive value)
          - "APPLICATIONINSIGHTS_CONNECTION_STRING" = (sensitive value)
          - "AZURE_SEARCH_API_KEY"                  = (sensitive value)
          - "AZURE_SEARCH_INDEX_NAME"               = "indexer"
          - "AZURE_SEARCH_SEMANTIC_CONFIG_NAME"     = "semantic-search-config"
          - "AZURE_SEARCH_SERVICE_NAME"             = "jwsemanticsearcher-eus2-dev-ss"
          - "OPENAI_DEPLOYMENT_NAME"                = "text-embedding-3-small"
          - "OPENAI_KEY"                            = (sensitive value)
          - "OPENAI_ORG_ID"                         = "org-FrSwBIfTy6cbV0sOmjkZyKYY"
          - "OPENAI_ORG_NAME"                       = "Personal"
          - "OPENAI_PROJECT_ID"                     = "proj_z02T1LalUIoCPlZqeuFzl5CK"
          - "OPENAI_PROJECT_NAME"                   = "jw-semantic-search"
        } -> (known after apply)
        id                                 = "/subscriptions/b9d5d1cf-2f79-4a8f-a3d6-73ddca47caed/resourceGroups/JwSemanticSearcher-eus2-dev-rg/providers/Microsoft.Web/staticSites/JwSemanticSearcher-eus2-dev-swa"
        name                               = "JwSemanticSearcher-eus2-dev-swa"
        tags                               = {
            "CreatedBy"   = "Terraform"
            "CreatedOn"   = "2023-06-23"
            "Environment" = "development"
            "Location"    = "East US 2"
            "Owner"       = "Cobollatin"
            "Project"     = "JW Semantic Searcher"
        }
        # (8 unchanged attributes hidden)
    }

  # github_actions_secret.use2_main_semantic_seach_flag["jw-semantic-searcher"] will be created
  + resource "github_actions_secret" "use2_main_semantic_seach_flag" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "jw-semantic-searcher"
      + secret_name     = "ENABLE_SEMANTIC_SEARCH"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.use2_main_ss_api_key["jw-semantic-searcher"] must be replaced
-/+ resource "github_actions_secret" "use2_main_ss_api_key" {
      ~ created_at      = "2024-11-20 07:03:18 +0000 UTC" -> (known after apply)
      ~ id              = "jw-semantic-searcher:AZURE_SEARCH_SERVICE_API_KEY" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-11-20 07:03:18 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.```
